In [1]:
import pandas as pd
import numpy as np

In [2]:
# These are used in slicing data from the Pandas DataFrame. 
# They help in the convenient selection of data from the DataFrame in Python.

In [3]:
# loc is the label based slicing where rows can be mentioned in range and cols in labels.
# considers even the last element of range
# df.loc[range,label_names]

# loc

In [4]:
data=pd.DataFrame({
    'model':['Maruthi',"MG","Hyundai","Benz","suzuthi","xuv","breeza","creta","Thar"],
    'price':[1200000,1300000,1500000,780000,8900000,2100000,4500000,8922222,79000000],
    'year':[2000,2001,2002,2003,2004,2005,2006,2007,2008],
    'speed':[100,200,300,400,500,600,700,800,900]
})
data

     model     price  year  speed
0  Maruthi   1200000  2000    100
1       MG   1300000  2001    200
2  Hyundai   1500000  2002    300
3     Benz    780000  2003    400
4  suzuthi   8900000  2004    500
5      xuv   2100000  2005    600
6   breeza   4500000  2006    700
7    creta   8922222  2007    800
8     Thar  79000000  2008    900

In [5]:
display(data.loc[2: 5]) #slicing gives values with in range

     model    price  year  speed
2  Hyundai  1500000  2002    300
3     Benz   780000  2003    400
4  suzuthi  8900000  2004    500
5      xuv  2100000  2005    600

In [6]:
display(data.loc[(data["model"] == 'Maruthi') & (data["speed"] > 20)]) #should satisfy both conditions

     model    price  year  speed
0  Maruthi  1200000  2000    100

In [7]:
display(data.loc[(data.model == 'Maruthi') & (data.speed> 20)]) #should satisfy both conditions method-2

     model    price  year  speed
0  Maruthi  1200000  2000    100

In [8]:
#loc is label based, select the row then  
data.loc[(data.model == 'Maruthi'), ['speed']] = 200
display(data)

     model     price  year  speed
0  Maruthi   1200000  2000    200
1       MG   1300000  2001    200
2  Hyundai   1500000  2002    300
3     Benz    780000  2003    400
4  suzuthi   8900000  2004    500
5      xuv   2100000  2005    600
6   breeza   4500000  2006    700
7    creta   8922222  2007    800
8     Thar  79000000  2008    900

In [9]:
data.loc[(data.year < 2002), ['speed']] = 220
display(data)

     model     price  year  speed
0  Maruthi   1200000  2000    220
1       MG   1300000  2001    220
2  Hyundai   1500000  2002    300
3     Benz    780000  2003    400
4  suzuthi   8900000  2004    500
5      xuv   2100000  2005    600
6   breeza   4500000  2006    700
7    creta   8922222  2007    800
8     Thar  79000000  2008    900

In [10]:
d=data.loc[2, ['speed','year']] #prints speed, year of the model of col2
display(d)

speed     300
year     2002
Name: 2, dtype: object

In [11]:
d1=data.loc[0:2,'model':'speed'] #gives 3 columns and rows from model to speed,used label based slicing
d1

     model    price  year  speed
0  Maruthi  1200000  2000    220
1       MG  1300000  2001    220
2  Hyundai  1500000  2002    300

# iloc

In [12]:
# iloc is the index based slicing where we mentions range in rows as well as cols 
# it does not consider the last element of the range. 
# index starts from 0 in both rows and cols

In [13]:
d1=data.iloc[0:2,1:3] 
d1

     price  year
0  1200000  2000
1  1300000  2001

In [14]:
d1=data.iloc[0:2,2]
d1

0    2000
1    2001
Name: year, dtype: int64

In [15]:
#gives the rows 0 and 1, cols with index 1 and 3
d1=data.iloc[0:2,[1,3]]
d1

     price  speed
0  1200000    220
1  1300000    220

In [16]:
d1=data.iloc[[0,2]]   #considers only rows
d1

     model    price  year  speed
0  Maruthi  1200000  2000    220
2  Hyundai  1500000  2002    300

In [17]:
d1=data.iloc[0,2]   #considers 2nd element of 0 index
d1

2000

In [18]:
d1=data.iloc[:,[0,2]]   #considers all rows and 0,1 cols
d1

     model  year
0  Maruthi  2000
1       MG  2001
2  Hyundai  2002
3     Benz  2003
4  suzuthi  2004
5      xuv  2005
6   breeza  2006
7    creta  2007
8     Thar  2008

In [20]:
df9=data.loc[data['model']=='Thar']
df9

  model     price  year  speed
8  Thar  79000000  2008    900